<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Untitled Document</title>
<style type="text/css">
<!--
.style1 {
	font-size: 36px;
	font-family: Arial, Helvetica, sans-serif;
	font-weight: bold;
}
.style3 {font-size: 18px; font-family: Arial, Helvetica, sans-serif; font-weight: bold; }
.style4 {
	font-size: 16px;
	font-family: Arial, Helvetica, sans-serif;
	font-weight: bold;
}
-->
</style>
</head>

<body>
<p align="center" class="style1">Historia del Software.</p>
<p align="center" class="style3"><span style="color: rgb(51, 51, 51); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; background-color: rgb(255, 255, 255); text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial; display: inline !important; float: none;">Podemos dividir la historia del software en las siguientes etapas partiendo desde su origen hasta su situaci&oacute;n en el siglo XXI:</span></p>
<ul>
  <li class="style4">Etapa anterior a 1950:&nbsp;Son d&eacute;cadas en las que se sientan las primeras bases y pinceladas del software. Como se ha mencionado en el ep&iacute;grafe anterior, Ada Lovelace y Alan Turing son los precursores del concepto &lsquo;software&rsquo;</li>
</ul>
<p class="style4">&nbsp;</p>
<ul class="style4">
  <li>.D&eacute;cada de los 50&rsquo; 60&rsquo; y 70&rsquo;: En estos a&ntilde;os el software pas&oacute; de ser un concepto te&oacute;rico y abstracto a ser reconocido como un factor indispensable para la invenci&oacute;n y desarrollo de dispositivos o m&aacute;quinas. Se acu&ntilde;a por primera vez en una conferencia de la OTAN el t&eacute;rmino &lsquo;ingenier&iacute;a de software&rsquo;. Esto es la primera muestra de una de las ciencias y profesiones m&aacute;s estudiadas y demandadas correspondientemente. En aquella &eacute;poca los lenguajes que m&aacute;s se utilizaban eran&nbsp;COBOL&nbsp;y&nbsp;FORTRAN.</li>
</ul>
<p class="style4">&nbsp;</p>
<ul class="style4">
  <li>D&eacute;cada de los 80&rsquo; y 90&rsquo;: En estas dos d&eacute;cadas se identifica un problema, y es que la gran demanda superaba la oferta de profesionales en la industria. Adem&aacute;s, los profesionales no pod&iacute;an abarcar tantas &aacute;reas de conocimiento sin especializaci&oacute;n previa. Surgieron los primeros colapsos en proyectos y trabajos de complejidad avanzada. Sin ir m&aacute;s lejos, en esta &eacute;poca se lanzan Windows en 1985 y Linux en 1992. Adem&aacute;s la aparici&oacute;n del lenguaje&nbsp;HTML&nbsp;es gracias al auge del World Wide Web (WWW), uno de los principales hitos de la era digital.</li>
</ul>
<p class="style4">&nbsp;</p>
<ul>
  <li class="style4">Siglo XXI: Desde principios del siglo XXI se han dado grandes avances en todos los campos que abarca el software. Desde la aparici&oacute;n de los revolucionarios smartphone, con un software integrado que hace que un &uacute;nico dispositivo pueda realizar tareas en las que antes se necesitaba un&nbsp;ordenador. Por otra parte, tambi&eacute;n se han llegado a niveles de desarrollo en tecnolog&iacute;as a&uacute;n por investigar y desarrollar como lo son la IA o las ya tan conocidas&nbsp;criptomonedas. Ejemplos de estos avances son los asistentes de voz de grandes compa&ntilde;&iacute;as como Apple, Microsoft o Amazon, los cuales pueden imitar el comportamiento humano. A estos efectos, se dan multitud de lenguajes de programaci&oacute;n en los que el objetivo del proyecto determina qu&eacute; lenguaje se debe utilizar y por ende, qu&eacute; tipo profesional en espec&iacute;fico se necesita. Algunos lenguajes que podemos mencionar son SWIFT (para aplicaciones en entornos iOS), JavaScript (para entornos web) o PHP (destinado a tareas y programaci&oacute;n de servidores o m&aacute;quinas f&iacute;sicas). </li>
</ul>
<p align="center" class="style1">&nbsp;</p>
<p>&nbsp;</p>
</body>
</html>
